<?php
$handler = new stdClass();
$handler->disabled = FALSE; /* Edit this to true to make a default handler disabled initially */
$handler->api_version = 1;
$handler->name = 'page_portada_dos_columnas';
$handler->task = 'page';
$handler->subtask = 'portada';
$handler->handler = 'panel_context';
$handler->weight = -29;
$handler->conf = array(
  'title' => 'portada dos columnas',
  'no_blocks' => 0,
  'pipeline' => 'standard',
  'body_classes_to_remove' => 'pm-pagina-portada',
  'body_classes_to_add' => 'pm-pagina-portada',
  'css_id' => 'pm-pagina-portada',
  'css' => '',
  'contexts' => array(),
  'relationships' => array(),
);
$display = new panels_display();
$display->layout = 'flexible';
$display->layout_settings = array(
  'items' => array(
    'canvas' => array(
      'type' => 'row',
      'contains' => 'column',
      'children' => array(
        0 => 'main',
      ),
      'parent' => NULL,
      'class' => '',
      'column_class' => '',
      'row_class' => '',
      'region_class' => '',
      'no_scale' => TRUE,
      'fixed_width' => '',
      'column_separation' => '',
      'region_separation' => '',
      'row_separation' => '',
    ),
    'main' => array(
      'type' => 'column',
      'width' => 100,
      'width_type' => '%',
      'children' => array(
        0 => 6,
        1 => 3,
        2 => 5,
      ),
      'parent' => 'canvas',
      'class' => '',
      'hide_empty' => 1,
    ),
    3 => array(
      'type' => 'row',
      'contains' => 'region',
      'children' => array(
        0 => 'columna_izquierda',
        1 => 'escaparate_superior',
      ),
      'parent' => 'main',
      'class' => 'escaparate-superior',
      'hide_empty' => 1,
    ),
    'escaparate_superior' => array(
      'type' => 'region',
      'title' => 'Columna-centro',
      'width' => '33.34038099387142',
      'width_type' => '%',
      'parent' => '3',
      'class' => 'una-columna',
      'hide_empty' => 1,
    ),
    5 => array(
      'type' => 'row',
      'contains' => 'region',
      'children' => array(
        0 => 'carrusel_ediciones',
      ),
      'parent' => 'main',
      'class' => 'carrusel-ediciones',
      'hide_empty' => 1,
    ),
    'carrusel_ediciones' => array(
      'type' => 'region',
      'title' => 'pie',
      'width' => 100,
      'width_type' => '%',
      'parent' => '5',
      'class' => '',
      'hide_empty' => 1,
    ),
    'columna_izquierda' => array(
      'type' => 'region',
      'title' => 'Columna izquierda',
      'width' => '33.34370282332937',
      'width_type' => '%',
      'parent' => '3',
      'class' => 'una-columna',
      'hide_empty' => 1,
    ),
    6 => array(
      'type' => 'row',
      'contains' => 'region',
      'children' => array(
        0 => 'top',
      ),
      'parent' => 'main',
      'class' => '',
      'hide_empty' => 1,
    ),
    'top' => array(
      'type' => 'region',
      'title' => 'top',
      'width' => 100,
      'width_type' => '%',
      'parent' => '6',
      'class' => '',
      'hide_empty' => 1,
    ),
  ),
);
$display->panel_settings = array(
  'style_settings' => array(
    'default' => NULL,
    'center' => NULL,
    'centrado_superior' => NULL,
    'centrado_inferior' => NULL,
    'capitel_superior' => NULL,
    'escaparate_superior' => NULL,
    'carrusel_ediciones' => NULL,
    'carrusel_ediciones1' => NULL,
    'carrusel_ediciones2' => NULL,
    'carrusel_ediciones3' => NULL,
    'columna_izquierda' => NULL,
    'columna_derecha' => NULL,
    'top' => NULL,
  ),
);
$display->cache = array();
$display->title = '';
$display->uuid = 'aa48ee40-5768-4c12-bc33-0071f7dfc9e0';
$display->content = array();
$display->panels = array();
  $pane = new stdClass();
  $pane->pid = 'new-043a6d3e-2677-4b0f-9e77-9c887d3da2f9';
  $pane->panel = 'carrusel_ediciones';
  $pane->type = 'banners74';
  $pane->subtype = 'banners74';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => NULL,
    'arguments' => '',
    'items' => '0',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 0,
    'offset' => '0',
    'pager' => 0,
    'more_link' => '',
    'admin_title' => '',
    'og_group' => NULL,
    'group' => '4',
    'image_style' => 'imagen-300',
    'sort' => 'portales7_banners_weight:ASC',
    'override_title' => 0,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'cinco-columnas',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '043a6d3e-2677-4b0f-9e77-9c887d3da2f9';
  $display->content['new-043a6d3e-2677-4b0f-9e77-9c887d3da2f9'] = $pane;
  $display->panels['carrusel_ediciones'][0] = 'new-043a6d3e-2677-4b0f-9e77-9c887d3da2f9';
  $pane = new stdClass();
  $pane->pid = 'new-e543d425-f10a-4725-a7d8-e5e655f54157';
  $pane->panel = 'columna_izquierda';
  $pane->type = 'banners74';
  $pane->subtype = 'banners74';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => NULL,
    'arguments' => '',
    'items' => '0',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 0,
    'offset' => '0',
    'pager' => 0,
    'more_link' => '',
    'admin_title' => '',
    'og_group' => NULL,
    'group' => 'Escaparate',
    'image_style' => 'imagen-300',
    'sort' => 'portales7_banners_weight:ASC',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'e543d425-f10a-4725-a7d8-e5e655f54157';
  $display->content['new-e543d425-f10a-4725-a7d8-e5e655f54157'] = $pane;
  $display->panels['columna_izquierda'][0] = 'new-e543d425-f10a-4725-a7d8-e5e655f54157';
  $pane = new stdClass();
  $pane->pid = 'new-222c01c3-ee30-4bc9-a37c-1b4202f765a7';
  $pane->panel = 'columna_izquierda';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => '6',
    'arguments' => '',
    'items' => '6',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '3',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => '',
    'admin_title' => 'grupo de noticias 3',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'paginador-grupo-noticias3',
    'id' => 'grupo-noticias3',
    'view_mode' => 'vinculo_noticia_resumen',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'una-columna extracto ',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '222c01c3-ee30-4bc9-a37c-1b4202f765a7';
  $display->content['new-222c01c3-ee30-4bc9-a37c-1b4202f765a7'] = $pane;
  $display->panels['columna_izquierda'][1] = 'new-222c01c3-ee30-4bc9-a37c-1b4202f765a7';
  $pane = new stdClass();
  $pane->pid = 'new-ad938bb1-dfa4-4087-8417-17b654d49e28';
  $pane->panel = 'columna_izquierda';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => '6',
    'arguments' => '',
    'items' => '3',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '9',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => 'listado-titulares/report',
    'admin_title' => 'grupo de noticias 4',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'paginador-grupo-noticias4',
    'id' => 'grupo-noticias-4',
    'view_mode' => 'vinculo_noticia_resumen',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'una-columna extracto',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = 'ad938bb1-dfa4-4087-8417-17b654d49e28';
  $display->content['new-ad938bb1-dfa4-4087-8417-17b654d49e28'] = $pane;
  $display->panels['columna_izquierda'][2] = 'new-ad938bb1-dfa4-4087-8417-17b654d49e28';
  $pane = new stdClass();
  $pane->pid = 'new-4c911440-bc91-4cc2-b810-000507ef6a5b';
  $pane->panel = 'columna_izquierda';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => '6',
    'arguments' => '',
    'items' => '6',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '9',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => '/listado-titulares/report',
    'admin_title' => 'grupo de noticias de titulares',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'grupo-noticias-4',
    'id' => 'grupo-noticias-4',
    'view_mode' => 'vinculo_noticia_titular',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'tres-columnas',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '4c911440-bc91-4cc2-b810-000507ef6a5b';
  $display->content['new-4c911440-bc91-4cc2-b810-000507ef6a5b'] = $pane;
  $display->panels['columna_izquierda'][3] = 'new-4c911440-bc91-4cc2-b810-000507ef6a5b';
  $pane = new stdClass();
  $pane->pid = 'new-71ab10a7-f67e-4099-a243-294a68e10f02';
  $pane->panel = 'columna_izquierda';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => 'event',
    'arguments' => '',
    'items' => '2',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '0',
    'sort' => 'portales7_eventdate:ASC',
    'pager' => '',
    'more_link' => 'listado-calendario',
    'admin_title' => 'Agenda resumen',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => '9',
    'id' => 'Agenda resumen',
    'view_mode' => 'vinculo_agenda_resumen',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'agenda1',
  );
  $pane->extras = array();
  $pane->position = 4;
  $pane->locks = array();
  $pane->uuid = '71ab10a7-f67e-4099-a243-294a68e10f02';
  $display->content['new-71ab10a7-f67e-4099-a243-294a68e10f02'] = $pane;
  $display->panels['columna_izquierda'][4] = 'new-71ab10a7-f67e-4099-a243-294a68e10f02';
  $pane = new stdClass();
  $pane->pid = 'new-9f0d69e6-fedf-48fe-8bee-d4bbfb55afa8';
  $pane->panel = 'escaparate_superior';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => '-1',
    'arguments' => 'anuncios',
    'items' => '3',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '0',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => '/listado-titulares/tablon de anuncios',
    'admin_title' => 'anuncios',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'paginador-grupo-anuncios',
    'id' => 'grupo-anuncios',
    'view_mode' => 'link',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'una-columna postit',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = '9f0d69e6-fedf-48fe-8bee-d4bbfb55afa8';
  $display->content['new-9f0d69e6-fedf-48fe-8bee-d4bbfb55afa8'] = $pane;
  $display->panels['escaparate_superior'][0] = 'new-9f0d69e6-fedf-48fe-8bee-d4bbfb55afa8';
  $pane = new stdClass();
  $pane->pid = 'new-35e4c507-9b47-4097-972d-48a43aa97e16';
  $pane->panel = 'escaparate_superior';
  $pane->type = 'avisosapp';
  $pane->subtype = 'avisosapp';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'script' => '',
    'id' => '',
    'type' => 'file',
    'send' => TRUE,
    'endpoint' => '',
    'method' => 'JSON',
    'override_title' => 1,
    'override_title_text' => 'Avisos',
    'override_title_heading' => 'h2',
    'numberRows' => '',
    'anchoDiv' => '250',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array();
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '35e4c507-9b47-4097-972d-48a43aa97e16';
  $display->content['new-35e4c507-9b47-4097-972d-48a43aa97e16'] = $pane;
  $display->panels['escaparate_superior'][1] = 'new-35e4c507-9b47-4097-972d-48a43aa97e16';
  $pane = new stdClass();
  $pane->pid = 'new-29f19554-0979-4d07-b821-fc9e6fb1ba8a';
  $pane->panel = 'escaparate_superior';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = FALSE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => '7',
    'arguments' => '',
    'items' => '3',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '2',
    'sort' => 'portales7_eventdate:ASC',
    'pager' => '',
    'more_link' => '',
    'admin_title' => 'Agenda titular',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => '1',
    'id' => 'Agenda titular',
    'view_mode' => 'vinculo_agenda_titular',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => '',
  );
  $pane->extras = array();
  $pane->position = 2;
  $pane->locks = array();
  $pane->uuid = '29f19554-0979-4d07-b821-fc9e6fb1ba8a';
  $display->content['new-29f19554-0979-4d07-b821-fc9e6fb1ba8a'] = $pane;
  $display->panels['escaparate_superior'][2] = 'new-29f19554-0979-4d07-b821-fc9e6fb1ba8a';
  $pane = new stdClass();
  $pane->pid = 'new-67c7275d-3f4d-4bee-bf42-6ca170b86d06';
  $pane->panel = 'escaparate_superior';
  $pane->type = 'banners74';
  $pane->subtype = 'banners74';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => NULL,
    'arguments' => '',
    'items' => '0',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 0,
    'offset' => '0',
    'pager' => 0,
    'more_link' => '',
    'admin_title' => '',
    'og_group' => NULL,
    'group' => 'Redes sociales',
    'image_style' => 'imagen-200',
    'sort' => 'portales7_banners_weight:ASC',
    'override_title' => 1,
    'override_title_text' => 'Redes sociales',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'dos-columnas',
  );
  $pane->extras = array();
  $pane->position = 3;
  $pane->locks = array();
  $pane->uuid = '67c7275d-3f4d-4bee-bf42-6ca170b86d06';
  $display->content['new-67c7275d-3f4d-4bee-bf42-6ca170b86d06'] = $pane;
  $display->panels['escaparate_superior'][3] = 'new-67c7275d-3f4d-4bee-bf42-6ca170b86d06';
  $pane = new stdClass();
  $pane->pid = 'new-d8e4d0fa-da10-48c0-b490-1aa98aadd76c';
  $pane->panel = 'top';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => 'report',
    'arguments' => '',
    'items' => '1',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '0',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => '',
    'admin_title' => 'grupo de noticias 1',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'paginador-grupo-noticias-1',
    'id' => 'grupo-noticias-1',
    'view_mode' => 'vinculo_noticia_resumen',
    'override_title' => 1,
    'override_title_text' => 'Noticias',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'destacado foto-izquierda',
  );
  $pane->extras = array();
  $pane->position = 0;
  $pane->locks = array();
  $pane->uuid = 'd8e4d0fa-da10-48c0-b490-1aa98aadd76c';
  $display->content['new-d8e4d0fa-da10-48c0-b490-1aa98aadd76c'] = $pane;
  $display->panels['top'][0] = 'new-d8e4d0fa-da10-48c0-b490-1aa98aadd76c';
  $pane = new stdClass();
  $pane->pid = 'new-1da1d9d2-7c9a-45ee-a278-154edd066afd';
  $pane->panel = 'top';
  $pane->type = 'definitivepane';
  $pane->subtype = 'definitivepane';
  $pane->shown = TRUE;
  $pane->access = array();
  $pane->configuration = array(
    'type' => 'report',
    'arguments' => '',
    'items' => '4',
    'classes' => NULL,
    'include_path' => 0,
    'promoted' => 1,
    'offset' => '1',
    'sort' => 'portales7_newsdate:DESC',
    'pager' => '',
    'more_link' => '',
    'admin_title' => 'grupo de noticias 2',
    'og_group' => NULL,
    'section' => 'any',
    'hide_description' => 0,
    'pager_id' => 'paginador-grupo-noticias-2',
    'id' => 'grupo-noticias2',
    'view_mode' => 'vinculo_noticia_resumen',
    'override_title' => 1,
    'override_title_text' => '',
    'override_title_heading' => 'h2',
  );
  $pane->cache = array();
  $pane->style = array(
    'settings' => NULL,
  );
  $pane->css = array(
    'css_id' => '',
    'css_class' => 'dos-columnas',
  );
  $pane->extras = array();
  $pane->position = 1;
  $pane->locks = array();
  $pane->uuid = '1da1d9d2-7c9a-45ee-a278-154edd066afd';
  $display->content['new-1da1d9d2-7c9a-45ee-a278-154edd066afd'] = $pane;
  $display->panels['top'][1] = 'new-1da1d9d2-7c9a-45ee-a278-154edd066afd';
$display->hide_title = PANELS_TITLE_NONE;
$display->title_pane = '0';
$handler->conf['display'] = $display;
